# Path Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileImportingEventArgs..::..Path Property
FileImportingEventArgs Class See Also
---
Path of the source file which is about to be imported.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public string Path { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Path As String
	Get
```

Visual C++
---
```text
public:
property String^ Path {
	String^ get ();
}
```

# See Also
FileImportingEventArgs Class
Autodesk.Revit.DB.Events Namespace